In [1]:
import numpy as np
import pandas as pd

In [13]:
# Create DataFrame
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie", "David","Abdullah","Smith"], #used it to create a datafarme with the given data
    "Age": [25, 30, 35, 40,50,60],
    "Salary": [50000, 60000, 55000, 65000,70000,710000]
}
df = pd.DataFrame(data)
print(df)

       Name  Age  Salary
0     Alice   25   50000
1       Bob   30   60000
2   Charlie   35   55000
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

In [8]:
print(df.head(10)) # used it when you want to see the first 10 rows of the datafarme, but here it will show only 6 rows since we have only 6 roes in data frams default is 5

       Name  Age  Salary
0     Alice   25   50000
1       Bob   30   60000
2   Charlie   35   55000
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

In [11]:
print(df.tail(2)) #Used it when you want to see the last 3 rows of the datafarme, but here it will show only 3 rows since we have only 6 rows in dataframe default is 5

       Name  Age  Salary
4  Abdullah   50   70000
5     Smith   60  710000

In [10]:
print(df.shape)  #used it to see the shape of the dataframe, it will show the number of rows and coloumns in the dataframe

(6, 3)

In [12]:
print(df.describe()) #used it to see the summary statistics of the datafarme ,it will show the count,mean,standard deviation,min,max and quartiles of the numeircal coloumnsin the datafarme

             Age         Salary
count   6.000000       6.000000
mean   40.000000  168333.333333
std    13.038405  265455.583228
min    25.000000   50000.000000
25%    31.250000   56250.000000
50%    37.500000   62500.000000
75%    47.500000   68750.000000
max    60.000000  710000.000000

# Filtering

In [16]:
df[df["Age"] > 30] #used it to filter the datafarme based on a condition,here it will show the rows where the age is greater tahmn 30
#condition = df['age'] >30
#df[condition]

       Name  Age  Salary
2   Charlie   35   55000
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

In [17]:
# salary is less than 55000
df[df['Salary'] < 55000]

    Name  Age  Salary
0  Alice   25   50000

In [ ]:
df[(df["Name"]=='Abdullah')] #here it will show the rows whre the name is Abdullah

       Name  Age  Salary
4  Abdullah   50   70000

In [ ]:
# Filtering
print("Age > 30:\n", df[df["Age"] > 30])

Age > 30:
        Name  Age  Salary
2   Charlie   35   55000
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

# Multiple condition based filtering

In [ ]:
# df[condition]
#df[(condition1)  logical operator (condition2) .....]

In [ ]:
df[    (df["Name"]=='Abdullah')       |     (df["Name"]=='Alice')         ]

       Name  Age  Salary
0     Alice   25   50000
4  Abdullah   50   70000

In [ ]:
df[    (df["Name"]=='Abdullah')       |     (df["Name"]=='Alice')        | (df["Name"]=='David')    ]

       Name  Age  Salary
0     Alice   25   50000
3     David   40   65000
4  Abdullah   50   70000

In [21]:
df[(df['Salary'] > 55000) & (df["Age"] > 30)]

       Name  Age  Salary
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

In [26]:
df[(df['Salary'] > 55000) & (df["Age"] > 30)    & (df['Name']=='Smith')           ]

    Name  Age  Salary
5  Smith   60  710000

In [27]:
df[(df['Salary'] > 55000) & (df["Age"] > 30)    & (df['Age']<60)           ]

       Name  Age  Salary
3     David   40   65000
4  Abdullah   50   70000

# Column selection

In [22]:
df['Name']

0       Alice
1         Bob
2     Charlie
3       David
4    Abdullah
5       Smith
Name: Name, dtype: object

In [20]:
df['Salary']

0     50000
1     60000
2     55000
3     65000
4     70000
5    710000
Name: Salary, dtype: int64

In [32]:
df[['Salary']]

   Salary
0   50000
1   60000
2   55000
3   65000
4   70000
5  710000

In [22]:
#df['Name','Salary'] error
df[['Name','Salary']]

       Name  Salary
0     Alice   50000
1       Bob   60000
2   Charlie   55000
3     David   65000
4  Abdullah   70000
5     Smith  710000

In [31]:
df[['Name','Age','Salary']]

       Name  Age  Salary
0     Alice   25   50000
1       Bob   30   60000
2   Charlie   35   55000
3     David   40   65000
4  Abdullah   50   70000
5     Smith   60  710000

# Calculated Field

In [33]:
# Adding a new column
df["Tax"] = df["Salary"] * 0.1
print(df)

       Name  Age  Salary      Tax
0     Alice   25   50000   5000.0
1       Bob   30   60000   6000.0
2   Charlie   35   55000   5500.0
3     David   40   65000   6500.0
4  Abdullah   50   70000   7000.0
5     Smith   60  710000  71000.0

In [34]:
# Make another column for increment 20% on salary
df["Increment"] = df["Salary"] * 0.2
print(df)

       Name  Age  Salary      Tax  Increment
0     Alice   25   50000   5000.0    10000.0
1       Bob   30   60000   6000.0    12000.0
2   Charlie   35   55000   5500.0    11000.0
3     David   40   65000   6500.0    13000.0
4  Abdullah   50   70000   7000.0    14000.0
5     Smith   60  710000  71000.0   142000.0

In [35]:
df["Salary Post Incrment"] = df["Salary"] + df["Increment"]
print(df)

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
0     Alice   25   50000   5000.0    10000.0               60000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
3     David   40   65000   6500.0    13000.0               78000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
5     Smith   60  710000  71000.0   142000.0              852000.0

# Sorting

In [38]:
df.sort_values("Salary")

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
0     Alice   25   50000   5000.0    10000.0               60000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
3     David   40   65000   6500.0    13000.0               78000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
5     Smith   60  710000  71000.0   142000.0              852000.0

In [39]:
df.sort_values("Salary",ascending=True) # useless

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
0     Alice   25   50000   5000.0    10000.0               60000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
3     David   40   65000   6500.0    13000.0               78000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
5     Smith   60  710000  71000.0   142000.0              852000.0

In [ ]:
df = df.sort_values("Salary", ascending=False) #for descending order
print(df)

In [52]:
df

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
5     Smith   60  710000  71000.0   142000.0              852000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
3     David   40   65000   6500.0    13000.0               78000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
0     Alice   25   50000   5000.0    10000.0               60000.0

In [53]:
df.sort_values("Salary",inplace=True)

In [54]:
df

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
0     Alice   25   50000   5000.0    10000.0               60000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
3     David   40   65000   6500.0    13000.0               78000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
5     Smith   60  710000  71000.0   142000.0              852000.0

In [55]:
df.sort_index()

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
0     Alice   25   50000   5000.0    10000.0               60000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
3     David   40   65000   6500.0    13000.0               78000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
5     Smith   60  710000  71000.0   142000.0              852000.0

In [56]:
df.sort_index(ascending = False)

       Name  Age  Salary      Tax  Increment  Salary Post Incrment
5     Smith   60  710000  71000.0   142000.0              852000.0
4  Abdullah   50   70000   7000.0    14000.0               84000.0
3     David   40   65000   6500.0    13000.0               78000.0
2   Charlie   35   55000   5500.0    11000.0               66000.0
1       Bob   30   60000   6000.0    12000.0               72000.0
0     Alice   25   50000   5000.0    10000.0               60000.0

###   df.sort_values("Salary",inplace=True)     equal to       df = df.sort_values("Salary")

# Loc and Iloc functions

In [57]:

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['NY', 'LA', 'Chicago', 'Houston']
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
print(df)

      Name  Age     City
a    Alice   25       NY
b      Bob   30       LA
c  Charlie   35  Chicago
d    David   40  Houston

In [ ]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['NY', 'LA', 'Chicago', 'Houston']
}

df = pd.DataFrame(data, index=list('abcd')) #used it to create a dataframe with cusdtom orders
print(df)

      Name  Age     City
a    Alice   25       NY
b      Bob   30       LA
c  Charlie   35  Chicago
d    David   40  Houston

In [ ]:
print(df.loc['b'])  #used it to access thew row with index b

Name    Bob
Age      30
City     LA
Name: b, dtype: object

In [61]:
df.loc['b']

Name    Bob
Age      30
City     LA
Name: b, dtype: object

In [ ]:
print(df.loc[['a', 'c']]) #used it to access the rows with index a and c

      Name  Age     City
a    Alice   25       NY
c  Charlie   35  Chicago

In [ ]:
print(df.loc['a', 'Name']) #used it to access the value in the row with index a and coloumn Name

Alice

In [ ]:
print(df.loc[['a', 'b'], ['Name', 'City']]) #used it to accessthr rows with index a and b and coloumns Name and City

    Name City
a  Alice   NY
b    Bob   LA

In [ ]:
print(df.loc['a':'c', ['Name', 'Age']]) #used it to access the rows from a to c and coloumns Name and Age

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [ ]:
print(df.iloc[1]) #used it to access the row with index a and we use iloc tro access the row by its position

Name    Bob
Age      30
City     LA
Name: b, dtype: object

In [67]:
df.iloc[[0, 2]]

      Name  Age     City
a    Alice   25       NY
c  Charlie   35  Chicago

In [ ]:
df.iloc[[0, 2],[1,2]] #used it to access the rows with index 0 and 2 and coloumns with index 1 and 2

   Age     City
a   25       NY
c   35  Chicago

In [ ]:
df.iloc[2:,1:] #used it to access the rows from index 2 to the end and coloumns from index 1 to the end

   Age     City
c   35  Chicago
d   40  Houston

In [ ]:
mask = df['Age'] > 30
print(mask)
print(df.loc[mask]) # why we use loc here? because we want to access the rows whre the condition is true
print(df[mask]) # this will also work, but loc is more explicit and preferred for

a    False
b    False
c     True
d     True
Name: Age, dtype: bool
      Name  Age     City
c  Charlie   35  Chicago
d    David   40  Houston

In [77]:
df["Age"] > 30

a    False
b    False
c     True
d     True
Name: Age, dtype: bool

In [78]:
df[df["Age"] > 30]

      Name  Age     City
c  Charlie   35  Chicago
d    David   40  Houston

In [ ]:
# Using iloc with boolean mask (same, but must match axis length)
mask_positions = [True, False, True, False] #used it to create a boolean mask to access the rows with index 0 and 2
print(df.iloc[mask_positions])

      Name  Age     City
a    Alice   25       NY
c  Charlie   35  Chicago